Repository: pjaol/safeflow
Catalog: Sources/Localizable.xcstrings
Source language: en
Languages: de, es, fr

source: 3 mo
de: 3 Mon.
es: 3 mes
fr: 3 mois

source: 6 mo
de: 6 Mon.
es: 6 mes
fr: 6 mois

source: Add a PIN or Face ID so only you can access Clio Daye.
de: Füge eine PIN oder Face ID hinzu, damit nur du auf Clio Daye zugreifen kannst.
es: Agrega un PIN o Face ID para que solo tú puedas acceder a Clio Daye.
fr: Ajoutez un code PIN ou Face ID pour que seule vous puissiez accéder à Clio Daye.

source: Avg cycle
de: Ø Zyklus
es: Ciclo prom.
fr: Cycle moy.

source: Average cycle: %lld days
de: Durchschnitt: %lld Tage
es: Ciclo promedio: %lld días
fr: Cycle moyen : %lld jours

source: Building accuracy — log more periods for a personalised range
de: Genauigkeit wird aufgebaut – protokolliere mehr Perioden für einen personalisierten Bereich.
es: Mejorando la precisión — registra más períodos para un rango personalizado.
fr: Précision en cours — enregistrez plus de règles pour une plage personnalisée.

source: Clio Daye is Locked
de: Clio Daye ist gesperrt
es: Clio Daye está bloqueada
fr: Clio Daye est verrouillée

source: Clio Daye stores all your data on this device only. No cloud, no account, no servers. It is physically impossible for us to access your data.
de: Clio Daye speichert alle deine Daten ausschließlich auf diesem Gerät. Keine Cloud, kein Konto, keine Server. Es ist physisch unmöglich für uns, auf deine Daten zuzugreifen.
es: Clio Daye almacena todos tus datos solo en este dispositivo. Sin nube, sin cuenta, sin servidores. Es físicamente imposible que accedamos a tus datos.
fr: Clio Daye stocke toutes vos données uniquement sur cet appareil. Pas de cloud, pas de compte, pas de serveurs. Il nous est physiquement impossible d'accéder à vos données.

source: Clio Daye stores everything on your device only. Nothing is sent to any server, cloud, or third party — ever. No one else can access your cycle data remotely.
de: Clio Daye speichert alles ausschließlich auf deinem Gerät. Nichts wird an Server, Cloud oder Dritte gesendet – niemals. Niemand anderes kann aus der Ferne auf deine Zyklusdaten zugreifen.
es: Clio Daye almacena todo solo en tu dispositivo. Nada se envía a ningún servidor, nube o tercero — nunca. Nadie más puede acceder a tus datos del ciclo de forma remota.
fr: Clio Daye stocke tout uniquement sur votre appareil. Rien n'est jamais envoyé à un serveur, un cloud ou un tiers. Personne d'autre ne peut accéder à vos données de cycle à distance.

source: Cycle Forecast
de: Zyklusprognose
es: Pronóstico del ciclo
fr: Prévision du cycle

source: Cycle overdue
de: Zyklus überfällig
es: Ciclo retrasado
fr: Cycle en retard

source: Cycle running longer than usual
de: Zyklus dauert länger als üblich
es: El ciclo dura más de lo habitual
fr: Le cycle dure plus longtemps que d'habitude

source: Cycle Tracking
de: Zyklustracking
es: Seguimiento del ciclo
fr: Suivi du cycle

source: Cycles can run longer for many reasons — stress, illness, changes in sleep or weight, or hormonal shifts. If this is unusual for you and you're concerned, a GP can help.
de: Zyklen können aus vielen Gründen länger dauern – Stress, Krankheit, Schlaf- oder Gewichtsveränderungen oder hormonelle Schwankungen. Wenn das ungewöhnlich für dich ist und du dir Sorgen machst, kann dir eine Ärztin oder ein Arzt helfen.
es: Los ciclos pueden durar más por muchas razones: estrés, enfermedad, cambios en el sueño o el peso, o cambios hormonales. Si esto es inusual para ti y te preocupa, un médico puede ayudarte.
fr: Les cycles peuvent durer plus longtemps pour de nombreuses raisons : stress, maladie, changements de sommeil ou de poids, ou fluctuations hormonales. Si c'est inhabituel pour vous et que vous êtes inquiète, un médecin peut vous aider.

source: Day 1 of one period to Day 1 of the next
de: Von Tag 1 einer Periode bis Tag 1 der nächsten
es: Del día 1 de un período al día 1 del siguiente
fr: Du jour 1 d'une règle au jour 1 de la suivante

source: Edit Logs
de: Einträge bearbeiten
es: Editar registros
fr: Modifier les entrées

source: Existing log — editing
de: Vorhandener Eintrag – wird bearbeitet
es: Registro existente — editando
fr: Entrée existante — modification en cours

source: Faded = less certain
de: Verblasst = weniger sicher
es: Difuminado = menos certeza
fr: Estompé = moins certain

source: Flow
de: Blutung
es: Flujo
fr: Flux

source: History
de: Verlauf
es: Historial
fr: Historique

source: How are you feeling today?
de: Wie geht es dir heute?
es: ¿Cómo te sientes hoy?
fr: Comment vous sentez-vous aujourd'hui ?

source: How common is this?
de: Wie häufig ist das?
es: ¿Qué tan común es esto?
fr: À quelle fréquence ?

source: How heavy is your flow?
de: Wie stark ist deine Blutung?
es: ¿Qué tan intensa es tu menstruación?
fr: Quel est votre flux ?

source: How long does your period last?
de: Wie lange dauert deine Periode?
es: ¿Cuánto dura tu período?
fr: Combien de jours durent vos règles ?

source: How long is your cycle usually?
de: Wie lang ist dein Zyklus normalerweise?
es: ¿Cuánto dura tu ciclo normalmente?
fr: Quelle est la durée habituelle de votre cycle ?

source: If you need help now
de: Wenn du jetzt Hilfe brauchst
es: Si necesitas ayuda ahora
fr: Si vous avez besoin d'aide maintenant

source: If you need to remove all data from this device, use the delete button below.
de: Wenn du alle Daten von diesem Gerät entfernen möchtest, verwende die Löschtaste unten.
es: Si necesitas eliminar todos los datos de este dispositivo, usa el botón de eliminar a continuación.
fr: Si vous devez supprimer toutes les données de cet appareil, utilisez le bouton de suppression ci-dessous.

source: Know Your Cycle
de: Kenne deinen Zyklus
es: Conoce tu ciclo
fr: Connaissez votre cycle

source: Log your first period to see a forecast
de: Protokolliere deine erste Periode, um eine Prognose zu sehen
es: Registra tu primer período para ver un pronóstico
fr: Enregistrez vos premières règles pour voir une prévision

source: Log your first period to see predictions
de: Protokolliere deine erste Periode, um Vorhersagen zu sehen
es: Registra tu primer período para ver predicciones
fr: Enregistrez vos premières règles pour voir des prévisions

source: Log your first period to see your cycle phase.
de: Protokolliere deine erste Periode, um deine Zyklusphase zu sehen.
es: Registra tu primer período para ver tu fase del ciclo.
fr: Enregistrez vos premières règles pour voir votre phase de cycle.

source: Log your first period to see your cycle phase and predictions.
de: Protokolliere deine erste Periode, um deine Zyklusphase und Vorhersagen zu sehen.
es: Registra tu primer período para ver tu fase del ciclo y las predicciones.
fr: Enregistrez vos premières règles pour voir votre phase de cycle et les prévisions.

source: Log your period, symptoms, and mood. Clio Daye learns your pattern and shows you where you are in your cycle every day.
de: Protokolliere deine Periode, Symptome und Stimmung. Clio Daye lernt dein Muster und zeigt dir täglich, wo du dich in deinem Zyklus befindest.
es: Registra tu período, síntomas y estado de ánimo. Clio Daye aprende tu patrón y te muestra cada día dónde estás en tu ciclo.
fr: Enregistrez vos règles, symptômes et humeur. Clio Daye apprend votre schéma et vous indique chaque jour où vous en êtes dans votre cycle.

source: Logged today
de: Heute protokolliert
es: Registrado hoy
fr: Enregistré aujourd'hui

source: Mood
de: Stimmung
es: Estado de ánimo
fr: Humeur

source: negative
de: negativ
es: negativo
fr: négatif

source: Next period
de: Nächste Periode
es: Próximo período
fr: Prochaines règles

source: No resources match these filters.
de: Keine Ressourcen entsprechen diesen Filtern.
es: Ningún recurso coincide con estos filtros.
fr: Aucune ressource ne correspond à ces filtres.

source: Not sure? Leave at 28 — we'll personalise this over time.
de: Nicht sicher? Lass es bei 28 — wir personalisieren dies mit der Zeit.
es: ¿No estás segura? Déjalo en 28 — lo personalizaremos con el tiempo.
fr: Pas sûre ? Laissez à 28 — nous personnaliserons cela au fil du temps.

source: Notes
de: Notizen
es: Notas

source: Nothing logged for this day
de: Für diesen Tag nichts protokolliert
es: Nada registrado para este día
fr: Rien d'enregistré pour ce jour

source: Nothing logged in %@
de: Nichts im %@ protokolliert
es: Nada registrado en %@
fr: Rien d'enregistré en %@

source: Nothing logged
de: Nichts protokolliert
es: Nada registrado
fr: Rien d'enregistré

source: Online resources only
de: Nur Online-Ressourcen
es: Solo recursos en línea
fr: Ressources en ligne uniquement

source: Period start · end
de: Periodenbeginn · Ende
es: Inicio · fin del período
fr: Début · fin des règles

source: positive
de: positiv
es: positivo
fr: positif

source: Predictions assume a typical 14-day luteal phase. Your experience may vary.
de: Prognosen gehen von einer typischen 14-tägigen Lutealphase aus. Deine Erfahrung kann abweichen.
es: Las predicciones asumen una fase lútea típica de 14 días. Tu experiencia puede variar.
fr: Les prévisions supposent une phase lutéale typique de 14 jours. Votre expérience peut varier.

source: Reading the chart
de: Diagramm lesen
es: Leyendo el gráfico
fr: Lire le graphique

source: Secure Your Data
de: Deine Daten sichern
es: Protege tus datos
fr: Sécurisez vos données

source: Set Up Face ID / Touch ID
de: Face ID / Touch ID einrichten
es: Configurar Face ID / Touch ID
fr: Configurer Face ID / Touch ID

source: Set Up PIN
de: PIN einrichten
es: Configurar PIN
fr: Configurer le code PIN

source: Set Up Your Cycle
de: Deinen Zyklus einrichten
es: Configura tu ciclo
fr: Configurez votre cycle

source: Start tracking
de: Tracking starten
es: Empieza a registrar
fr: Commencer le suivi

source: Symptoms
de: Symptome
es: Síntomas
fr: Symptômes

source: Tap a date for details
de: Tippe auf ein Datum für Details
es: Toca una fecha para ver detalles
fr: Appuyez sur une date pour les détails

source: Tap for details
de: Tippen für Details
es: Toca para ver detalles
fr: Appuyez pour les détails

source: Tap the pencil to add an entry for this day.
de: Tippe auf den Stift, um einen Eintrag für diesen Tag hinzuzufügen.
es: Toca el lápiz para agregar una entrada para este día.
fr: Appuyez sur le crayon pour ajouter une entrée pour ce jour.

source: Tell us a little about your cycle so predictions start right away.
de: Erzähl uns ein wenig über deinen Zyklus, damit Vorhersagen sofort beginnen.
es: Cuéntanos un poco sobre tu ciclo para que las predicciones comiencen de inmediato.
fr: Dites-nous un peu sur votre cycle pour que les prévisions commencent tout de suite.

source: The fertile window shown is an estimate for cycle awareness only. Clio Daye is not a contraceptive method and cannot predict fertility with certainty.
de: Das angezeigte fruchtbare Fenster ist nur eine Schätzung zur Zyklusbewusstsein. Clio Daye ist keine Verhütungsmethode und kann die Fruchtbarkeit nicht mit Sicherheit vorhersagen.
es: La ventana fértil mostrada es solo una estimación para la conciencia del ciclo. Clio Daye no es un método anticonceptivo y no puede predecir la fertilidad con certeza.
fr: La fenêtre fertile affichée est une estimation uniquement pour la conscience du cycle. Clio Daye n'est pas une méthode contraceptive et ne peut pas prédire la fertilité avec certitude.

source: The fertile window shown is an estimate for cycle awareness only. Clio Daye is not a contraceptive method.
de: Das angezeigte fruchtbare Fenster ist nur eine Schätzung zur Zyklusbewusstsein. Clio Daye ist keine Verhütungsmethode.
es: La ventana fértil mostrada es solo una estimación para la conciencia del ciclo. Clio Daye no es un método anticonceptivo.
fr: La fenêtre fertile affichée est une estimation uniquement pour la conscience du cycle. Clio Daye n'est pas une méthode contraceptive.

source: These are independent organisations. Clio Daye does not share your data with them. Links open in your browser.
de: Dies sind unabhängige Organisationen. Clio Daye gibt deine Daten nicht an sie weiter. Links öffnen sich in deinem Browser.
es: Son organizaciones independientes. Clio Daye no comparte tus datos con ellas. Los enlaces se abren en tu navegador.
fr: Ce sont des organisations indépendantes. Clio Daye ne partage pas vos données avec elles. Les liens s'ouvrent dans votre navigateur.

source: This will permanently delete all your cycle logs, symptoms, and notes. This cannot be undone.
de: Dadurch werden alle deine Zyklusprotokolle, Symptome und Notizen dauerhaft gelöscht. Dies kann nicht rückgängig gemacht werden.
es: Esto eliminará permanentemente todos tus registros de ciclo, síntomas y notas. Esto no se puede deshacer.
fr: Cela supprimera définitivement tous vos journaux de cycle, symptômes et notes. Cette action est irréversible.

source: Use Face ID or Touch ID to protect your data
de: Verwende Face ID oder Touch ID zum Schutz deiner Daten
es: Usa Face ID o Touch ID para proteger tus datos
fr: Utilisez Face ID ou Touch ID pour protéger vos données

source: When did your last period start?
de: Wann hat deine letzte Periode begonnen?
es: ¿Cuándo comenzó tu último período?
fr: Quand ont commencé vos dernières règles ?

source: Your Data & Privacy
de: Deine Daten & Datenschutz
es: Tus datos y privacidad
fr: Vos données et confidentialité

source: Your cycle is running longer than usual.
de: Dein Zyklus dauert länger als üblich.
es: Tu ciclo está durando más de lo habitual.
fr: Votre cycle dure plus longtemps que d'habitude.

source: Your Privacy First
de: Ihre Privatsphäre zuerst
es: Tu privacidad primero
fr: Votre vie privée d'abord

source: Skip for Now
de: Jetzt überspringen
es: Omitir por ahora
fr: Passer pour l'instant

source: Get Started
de: Loslegen
es: Comenzar
fr: Commencer

source: Skip setup
de: Einrichtung überspringen
es: Omitir configuración
fr: Passer la configuration

source: %lld days
de: %lld Tage
es: %lld días
fr: %lld jours

source: Cramps
de: Krämpfe
es: Cólicos
fr: Crampes

source: Spotting
de: Schmierblutung
es: Manchado

source: Light
de: Leicht
es: Leve
fr: Léger

source: Medium
de: Mittel
es: Moderado
fr: Modéré

source: Heavy
de: Stark
es: Abundante
fr: Abondant

source: Headache
de: Kopfschmerzen
es: Dolor de cabeza
fr: Maux de tête

source: Bloating
de: Blähungen
es: Hinchazón
fr: Ballonnements

source: Tenderness
de: Empfindlichkeit
es: Sensibilidad
fr: Sensibilité

source: Back Pain
de: Rückenschmerzen
es: Dolor de espalda
fr: Douleurs dorsales

source: Acne
de: Akne
es: Acné
fr: Acné

source: Fatigue
de: Müdigkeit
es: Fatiga

source: Insomnia
de: Schlaflosigkeit
es: Insomnio
fr: Insomnie

source: High Energy
de: Viel Energie
es: Alta energía
fr: Haute énergie

source: Brain Fog
de: Gehirnnebel
es: Niebla mental
fr: Brouillard mental

source: Cravings
de: Heißhunger
es: Antojos
fr: Envies

source: Nausea
de: Übelkeit
es: Náuseas
fr: Nausées

source: Appetite
de: Appetit
es: Apetito
fr: Appétit

source: Discharge
de: Ausfluss
es: Flujo
fr: Pertes

source: Ovulation
de: Eisprung
es: Ovulación

source: Pain
de: Schmerz
es: Dolor
fr: Douleur

source: Energy
de: Energie
es: Energía
fr: Énergie

source: Body
de: Körper
es: Cuerpo
fr: Corps

source: Energized
de: Energiegeladen
es: Con energía
fr: Énergisé

source: Happy
de: Glücklich
es: Feliz
fr: Heureux

source: Confident
de: Selbstbewusst
es: Seguro
fr: Confiant

source: Calm
de: Ruhig
es: Tranquilo
fr: Calme

source: Focused
de: Konzentriert
es: Concentrado
fr: Concentré

source: Foggy
de: Benebelt
es: Confuso
fr: Embrouillé

source: Tired
de: Müde
es: Cansado
fr: Fatigué

source: Sensitive
de: Sensibel
es: Sensible
fr: Sensible

source: Anxious
de: Ängstlich
es: Ansioso
fr: Anxieux

source: Irritable
de: Gereizt

source: Sad
de: Traurig
es: Triste
fr: Triste

source: Predicted
de: Vorhergesagt
es: Previsto
fr: Prévu

source: Note
de: Notiz
es: Nota

source: Period
de: Periode
es: Período
fr: Règles

source: Fertile
de: Fruchtbar
es: Fértil

source: %lld alert
de: %lld Alarm
es: %lld alerta
fr: %lld alerte

source: %lld alerts
de: %lld Alarme
es: %lld alertas
fr: %lld alertes

source: 1 insight
de: 1 Einblick
es: 1 perspectiva
fr: 1 aperçu

source: 1 tip
de: 1 Tipp
es: 1 consejo
fr: 1 conseil

source: Cycle
de: Zyklus
es: Ciclo

source: Overview
de: Übersicht
es: Resumen
fr: Aperçu

source: Alerts
de: Alarme
es: Alertas
fr: Alertes

source: Done
de: Fertig
es: Listo
fr: Terminé

source: Insights
de: Einblicke
es: Perspectivas
fr: Aperçus

source: Tips
de: Tipps
es: Consejos
fr: Conseils

source: Week View
de: Wochenansicht
es: Vista semanal
fr: Vue hebdomadaire

source: End
de: Ende
es: Fin
fr: Fin

source: Range
de: Zeitraum
es: Rango
fr: Plage

source: Set Up Security
de: Sicherheit einrichten
es: Configurar seguridad
fr: Configurer la sécurité

source: Unlock with Face ID/Touch ID
de: Mit Face ID/Touch ID entsperren
es: Desbloquear con Face ID/Touch ID
fr: Déverrouiller avec Face ID/Touch ID

source: Use PIN Instead
de: Stattdessen PIN verwenden
es: Usar PIN en su lugar
fr: Utiliser le PIN à la place

source: Enter PIN
de: PIN eingeben
es: Ingresar PIN
fr: Entrer le PIN

source: · Day %lld
de: · Tag %lld
es: · Día %lld
fr: · Jour %lld

source: Next period %@
de: Nächste Periode %@
es: Próximo período %@
fr: Prochaines règles %@

source: Skip
de: Überspringen
es: Omitir
fr: Ignorer

source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité

source: Require Authentication
de: Authentifizierung erforderlich
es: Requerir autenticación
fr: Exiger l'authentification

source: Test Face ID/Touch ID
de: Face ID/Touch ID testen
es: Probar Face ID/Touch ID
fr: Tester Face ID/Touch ID

source: Change PIN
de: PIN ändern
es: Cambiar PIN
fr: Changer le PIN

source: Your data stays on this device
de: Deine Daten bleiben auf diesem Gerät
es: Tus datos se quedan en este dispositivo
fr: Tes données restent sur cet appareil

source: Delete All My Data
de: Alle meine Daten löschen
es: Eliminar todos mis datos
fr: Supprimer toutes mes données

source: About
de: Über
es: Acerca de
fr: À propos

source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de privacidad
fr: Politique de confidentialité

source: Settings
de: Einstellungen
es: Ajustes
fr: Réglages

source: Set Up Face ID/Touch ID
de: Face ID/Touch ID einrichten
es: Configurar Face ID/Touch ID
fr: Configurer Face ID/Touch ID

source: Set Up
de: Einrichten
es: Configurar
fr: Configurer

source: Delete All Data?
de: Alle Daten löschen?
es: ¿Eliminar todos los datos?
fr: Supprimer toutes les données ?

source: Delete Everything
de: Alles löschen
es: Eliminar todo
fr: Tout supprimer

source: Get Support
de: Hilfe & Ressourcen
es: Obtener apoyo
fr: Obtenir de l'aide

source: All
de: Alle
es: Todas
fr: Toutes

source: Visit
de: Besuchen
es: Visitar
fr: Visiter

source: OB/GYN & Specialist
de: OB/GYN & Facharzt
es: Ginecología & Especialista
fr: Gynécologie & Spécialiste

source: PMDD & Premenstrual Disorders
de: PMDS & Prämenstruelle Störungen
es: TDPM & Trastornos Premenstruales
fr: TDPM & Troubles Prémenstruels

source: Endometriosis
de: Endometriose
fr: Endométriose

source: General Health Info
de: Allgemeine Gesundheitsinfos
es: Información general de salud
fr: Informations générales sur la santé

source: Crisis & Safety
de: Krise & Sicherheit
es: Crisis y seguridad
fr: Crise et sécurité

source: Mental Health
de: Psychische Gesundheit
es: Salud mental
fr: Santé mentale

source: Reproductive Health
de: Reproduktive Gesundheit
es: Salud reproductiva
fr: Santé reproductive

source: United States
de: Vereinigte Staaten
es: Estados Unidos
fr: États-Unis

source: United Kingdom
de: Vereinigtes Königreich
es: Reino Unido
fr: Royaume-Uni

source: Australia
de: Australien
fr: Australie

source: Canada
de: Kanada
es: Canadá

source: Sexual Health
de: Sexuelle Gesundheit
es: Salud sexual
fr: Santé sexuelle

source: Edit Log
de: Eintrag bearbeiten
es: Editar registro
fr: Modifier l'entrée

source: New Log
de: Neuer Eintrag
es: Nuevo registro
fr: Nouvel entrée

source: How are you feeling?
de: Wie geht es dir?
es: ¿Cómo te sientes?
fr: Comment tu te sens ?

source: None
de: Keine
es: Ninguno
fr: Aucun

source: %lld selected
de: %lld ausgewählt
es: %lld seleccionados
fr: %lld sélectionnés

source: Save Log
de: Eintrag speichern
es: Guardar registro
fr: Enregistrer l'entrée

source: Update Log
de: Eintrag aktualisieren
es: Actualizar registro
fr: Mettre à jour l'entrée

source: Saved
de: Gespeichert
es: Guardado
fr: Enregistré

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler

source: Save
de: Speichern
es: Guardar
fr: Enregistrer

source: Previous month
de: Vorheriger Monat
es: Mes anterior
fr: Mois précédent

source: Next month
de: Nächster Monat
es: Mes siguiente
fr: Mois suivant

source: Your cycles are running short
de: Dein Zyklus ist zu kurz
es: Tus ciclos son cortos
fr: Vos cycles sont trop courts

source: Your cycles are running long
de: Dein Zyklus ist zu lang
es: Tus ciclos son largos
fr: Vos cycles sont trop longs

source: Your cycle length varies a lot
de: Deine Zykluslänge schwankt stark
es: La duración de tus ciclos varía mucho
fr: La durée de vos cycles varie beaucoup

source: Your periods are running long
de: Deine Periode dauert zu lange
es: Tus períodos son largos
fr: Vos règles durent longtemps

source: You've been logging cramps
de: Du hast Krämpfe erfasst
es: Has registrado cólicos
fr: Vous avez noté des crampes

source: Your average cycle is around %lld days. Cycles shorter than 21 days are worth mentioning to a doctor — it’s a common and treatable pattern.
de: Dein durchschnittlicher Zyklus beträgt etwa %lld Tage. Zyklen unter 21 Tagen solltest du mit einer Ärztin besprechen — das ist ein häufiges und behandelbares Muster.
es: Tu ciclo promedio es de %lld días. Los ciclos de menos de 21 días vale la pena mencionárselos a un médico — es un patrón común y tratable.
fr: Votre cycle moyen dure environ %lld jours. Les cycles inférieurs à 21 jours méritent d’être mentionnés à un médecin — c’est un schéma courant et traitable.

source: Your average cycle is around %lld days. Cycles over 35 days can have a few different causes — a doctor can help figure out what’s going on.
de: Dein durchschnittlicher Zyklus beträgt etwa %lld Tage. Zyklen über 35 Tage können verschiedene Ursachen haben — eine Ärztin kann helfen, das abzuklären.
es: Tu ciclo promedio es de %lld días. Los ciclos de más de 35 días pueden tener varias causas — un médico puede ayudarte a entender qué está pasando.
fr: Votre cycle moyen dure environ %lld jours. Les cycles supérieurs à 35 jours peuvent avoir plusieurs causes — un médecin peut vous aider à comprendre ce qui se passe.

source: Periods consistently over 7 days are worth mentioning to a doctor. There are several common, treatable causes.
de: Perioden, die durchgehend über 7 Tage dauern, solltest du mit einer Ärztin besprechen. Es gibt mehrere häufige, behandelbare Ursachen.
es: Los períodos que duran más de 7 días de forma constante merecen mencionarse a un médico. Hay varias causas comunes y tratables.
fr: Des règles qui durent régulièrement plus de 7 jours méritent d’être signalées à un médecin. Il existe plusieurs causes courantes et traitables.

source: A few things that can help: heat on your lower abdomen, ibuprofen taken with food at the first sign (not after), and magnesium-rich foods like dark chocolate and nuts.
de: Ein paar Dinge, die helfen können: Wärme auf dem Unterbauch, Ibuprofen beim ersten Anzeichen mit Essen nehmen (nicht danach) und magnesiumreiche Lebensmittel wie dunkle Schokolade und Nüsse.
es: Algunas cosas que pueden ayudar: calor en el abdomen inferior, ibuprofeno tomado con comida al primer signo (no después) y alimentos ricos en magnesio como el chocolate negro y los frutos secos.
fr: Quelques choses qui peuvent aider : de la chaleur sur le bas-ventre, de l’ibuprofène pris avec de la nourriture aux premiers signes (pas après), et des aliments riches en magnésium comme le chocolat noir et les noix.
